# BuiltInFailures.ZoneFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ZoneFailures Class
BuiltInFailures Class Members See Also
---
Failures about Zone.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ZoneFailures
```

Visual Basic
---
```text
Public NotInheritable Class ZoneFailures
```

Visual C++
---
```text
public ref class ZoneFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ZoneFailures
# See Also
BuiltInFailures..::..ZoneFailures Members
Autodesk.Revit.DB Namespace